数据结构/栈和队列.org
* 不同的结构类型
** 工具
 - 数组用来作为构思算法的辅助工具
** 受限访问
 - 特定时刻只允许一个数据项被操作
** 更加抽象
 - 通过接口对数据结构进行定义
* 栈
** 特点
 - 只允许一个数据被操作
