publish/html/栈和队列.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>栈和队列</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-10-05 15:41:20 "/>
<meta name="author" content="emacsers"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">栈和队列</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 不同的结构类型 </a>
<ul>
<li><a href="#sec-1-1">1.1 工具 </a></li>
<li><a href="#sec-1-2">1.2 受限访问 </a></li>
<li><a href="#sec-1-3">1.3 更加抽象 </a></li>
</ul>
</li>
<li><a href="#sec-2">2 栈 </a>
<ul>
<li><a href="#sec-2-1">2.1 特点 </a></li>
<li><a href="#sec-2-2">2.2 例子 </a></li>
</ul>
</li>
<li><a href="#sec-3">3 队列 </a>
<ul>
<li><a href="#sec-3-1">3.1 特点 </a></li>
<li><a href="#sec-3-2">3.2 例子 </a></li>
<li><a href="#sec-3-3">3.3 基本操作 </a></li>
<li><a href="#sec-3-4">3.4 循环队列 </a>
<ul>
<li><a href="#sec-3-4-1">3.4.1 特点 </a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5 环绕式处理 </a>
<ul>
<li><a href="#sec-3-5-1">3.5.1 特点 </a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6 队列的效率 </a></li>
</ul>
</li>
<li><a href="#sec-4">4 优先级队列 </a>
<ul>
<li><a href="#sec-4-1">4.1 特点 </a></li>
<li><a href="#sec-4-2">4.2 例子 </a></li>
</ul>
</li>
<li><a href="#sec-5">5 解析算数表达式 </a>
<ul>
<li><a href="#sec-5-1">5.1 例子 </a></li>
<li><a href="#sec-5-2">5.2 思路 </a>
<ul>
<li><a href="#sec-5-2-1">5.2.1 后缀表达法 </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 不同的结构类型 </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 工具 </h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>数组用来作为构思算法的辅助工具
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 受限访问 </h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>特定时刻只允许一个数据项被操作
</li>
</ul>

</div>

</div>
