publish/html/栈和队列.html

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 更加抽象 </h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li>通过接口对数据结构进行定义
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 栈 </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 特点 </h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>只允许一个数据被操作
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 例子 </h3>
<div class="outline-text-3" id="text-2-2">




<pre class="src src-java"> <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">StackX</span>
   {
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">maxSize</span>;        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">size of stack array</span>
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">long</span>[] <span style="color: #7fffd4; font-weight: bold;">stackArray</span>;
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">top</span>;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">top of stack</span>
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> StackX(<span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">s</span>)         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      {
      maxSize = s;             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">set array size</span>
      stackArray = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">long</span>[maxSize];  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">create array</span>
      top = -1;                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">no items yet</span>
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">push</span>(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">j</span>)    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">put item on top of stack</span>
      {
      stackArray[++top] = j;     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">increment top, insert item</span>
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">pop</span>()           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">take item from top of stack</span>
      {
      <span style="color: #fa8072;">return</span> stackArray[top--];  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">access item, decrement top</span>
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">peek</span>()          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">peek at top of stack</span>
      {
      <span style="color: #fa8072;">return</span> stackArray[top];
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">boolean</span> <span style="color: #7fffd4; font-weight: bold;">isEmpty</span>()    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">true if stack is empty</span>
      {
      <span style="color: #fa8072;">return</span> (top == -1);
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">boolean</span> <span style="color: #7fffd4; font-weight: bold;">isFull</span>()     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">true if stack is full</span>
      {
      <span style="color: #fa8072;">return</span> (top == maxSize-1);
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   }
</pre>



<ul>
<li>单词逆序
</li>
</ul>




<pre class="src src-java"> <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">Reverser</span>
   {
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">input</span>;                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">input string</span>
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">output</span>;               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">output string</span>
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> Reverser(<span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">in</span>)           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      { input = in; }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">doRev</span>()                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">reverse the string</span>
      {
      <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">stackSize</span> = input.length();   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">get max stack size</span>
      <span style="color: #9acd32; font-weight: bold;">StackX</span> <span style="color: #7fffd4; font-weight: bold;">theStack</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">StackX</span>(stackSize);  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">make stack</span>

      <span style="color: #fa8072;">for</span>(<span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">j</span>=0; j&lt;input.length(); j++)
         {
         <span style="color: #9acd32; font-weight: bold;">char</span> <span style="color: #7fffd4; font-weight: bold;">ch</span> = input.charAt(j);     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">get a char from input</span>
         theStack.push(ch);             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">push it</span>
         }
      output = <span style="color: #ffa07a;">""</span>;
      <span style="color: #fa8072;">while</span>( !theStack.isEmpty() )
         {
         <span style="color: #9acd32; font-weight: bold;">char</span> <span style="color: #7fffd4; font-weight: bold;">ch</span> = theStack.pop();      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">pop a char,</span>
         output = output + ch;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">append to output</span>
         }
      <span style="color: #fa8072;">return</span> output;
      }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end doRev()</span>
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end class Reverser</span>
</pre>



<ul>
<li>分隔符匹配
</li>
</ul>




<pre class="src src-java"> <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">BracketChecker</span>
   {
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">input</span>;                   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">input string</span>
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> BracketChecker(<span style="color: #9acd32; font-weight: bold;">String</span> <span style="color: #7fffd4; font-weight: bold;">in</span>)        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      { input = in; }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">check</span>()
      {
      <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">stackSize</span> = input.length();      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">get max stack size</span>
      <span style="color: #9acd32; font-weight: bold;">StackX</span> <span style="color: #7fffd4; font-weight: bold;">theStack</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">StackX</span>(stackSize);  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">make stack</span>

      <span style="color: #fa8072;">for</span>(<span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">j</span>=0; j&lt;input.length(); j++)  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">get chars in turn</span>
         {
         <span style="color: #9acd32; font-weight: bold;">char</span> <span style="color: #7fffd4; font-weight: bold;">ch</span> = input.charAt(j);        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">get char</span>
         <span style="color: #fa8072;">switch</span>(ch)
            {
            <span style="color: #fa8072;">case</span> <span style="color: #ffa07a;">'{'</span>:                      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">opening symbols</span>
            <span style="color: #fa8072;">case</span> <span style="color: #ffa07a;">'['</span>:
            <span style="color: #fa8072;">case</span> <span style="color: #ffa07a;">'('</span>:
               theStack.push(ch);          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">push them</span>
               <span style="color: #fa8072;">break</span>;

            <span style="color: #fa8072;">case</span> <span style="color: #ffa07a;">'}'</span>:                      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">closing symbols</span>
            <span style="color: #fa8072;">case</span> <span style="color: #ffa07a;">']'</span>:
            <span style="color: #fa8072;">case</span> <span style="color: #ffa07a;">')'</span>:
               <span style="color: #fa8072;">if</span>( !theStack.isEmpty() )   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if stack not empty,</span>
                  {
                  <span style="color: #9acd32; font-weight: bold;">char</span> <span style="color: #7fffd4; font-weight: bold;">chx</span> = theStack.pop();  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">pop and check</span>
                  <span style="color: #fa8072;">if</span>( (ch==<span style="color: #ffa07a;">'}'</span> &amp;&amp; chx!=<span style="color: #ffa07a;">'{'</span>) ||
                      (ch==<span style="color: #ffa07a;">']'</span> &amp;&amp; chx!=<span style="color: #ffa07a;">'['</span>) ||
                      (ch==<span style="color: #ffa07a;">')'</span> &amp;&amp; chx!=<span style="color: #ffa07a;">'('</span>) )
                     System.out.println(<span style="color: #ffa07a;">"Error: "</span>+ch+<span style="color: #ffa07a;">" at "</span>+j);
                  }
               <span style="color: #fa8072;">else</span>                        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">prematurely empty</span>
                  System.out.println(<span style="color: #ffa07a;">"Error: "</span>+ch+<span style="color: #ffa07a;">" at "</span>+j);
               <span style="color: #fa8072;">break</span>;
            <span style="color: #fa8072;">default</span>:    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">no action on other characters</span>
               <span style="color: #fa8072;">break</span>;
            }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end switch</span>
         }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end for</span>
      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">at this point, all characters have been processed</span>
      <span style="color: #fa8072;">if</span>( !theStack.isEmpty() )
         System.out.println(<span style="color: #ffa07a;">"Error: missing right delimiter"</span>);
      }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end check()</span>
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   }  
</pre>



</div>
</div>

</div>
