数据结构/栈和队列.org
* 队列
** 特点
 - 类型栈,先进先出
** 例子
 - 队列类
#+BEGIN_SRC java
 class Queue
   {
   private int maxSize;
   private long[] queArray;
   # 队首位置
   private int front;
   # 队尾位置
   private int rear;
   # 已有元素个数
   private int nItems;
//---------------------------------------------------------------
# 队列的初始化状态: 队首为0,队尾为-1
   public Queue(int s)          // constructor
      {
      maxSize = s;
      queArray = new long[maxSize];
      front = 0;
      rear = -1;
      nItems = 0;
      }
//--------------------------------------------------------------
# 插入数据后的状态: 队首不变,队尾+1,如果队列最大个数为1,则队尾为-1
   public void insert(long j)   // put item at rear of queue
      {
      if(rear == maxSize-1)         // deal with wraparound
         rear = -1;
      queArray[++rear] = j;         // increment rear and insert
      nItems++;                     // one more item
      }
//--------------------------------------------------------------
# 删除数据后的状态: 队首+1,,如果队首与队列元素个数相同,则队首设置为0
   public long remove()         // take item from front of queue
      {
      long temp = queArray[front++]; // get value and incr front
      if(front == maxSize)           // deal with wraparound
         front = 0;
      nItems--;                      // one less item
      return temp;
      }
//--------------------------------------------------------------
   public long peekFront()      // peek at front of queue
      {
      return queArray[front];
      }
//--------------------------------------------------------------
   public boolean isEmpty()    // true if queue is empty
      {
      return (nItems==0);
      }
//--------------------------------------------------------------
   public boolean isFull()     // true if queue is full
      {
      return (nItems==maxSize);
      }
//--------------------------------------------------------------
   public int size()           // number of items in queue
      {
      return nItems;
      }
#+END_SRC
** 基本操作
 - 插入队尾
 - 移出对头
** 循环队列
*** 特点
 - 通过队头和队尾的移动来保持位置
 - 如果队尾移动到数组顶端,则无法继续插入数据
**  环绕式处理 
*** 特点
 - 让队头和队尾指针回到初始状态
 - 插入更多数据,队尾指针回绕
 - 删除更多数据,队首指针回绕
** 队列的效率
 - 同栈一样,插入或删除数据项的复杂度是o(1)
* 优先级队列
** 特点
 - 数据项按关键字的值排序
 - 数据在插入时会按照顺序
