publish/html/栈和队列.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 优先级队列 </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 特点 </h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>数据项按关键字的值排序
</li>
<li>数据在插入时会按照顺序
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 例子 </h3>
<div class="outline-text-3" id="text-4-2">




<pre class="src src-java">  <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">PriorityQ</span>
   {
   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">array in sorted order, from max at 0 to min at size-1</span>
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">maxSize</span>;
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">long</span>[] <span style="color: #7fffd4; font-weight: bold;">queArray</span>;
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">nItems</span>;
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> PriorityQ(<span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">s</span>)          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      {
      maxSize = s;
      queArray = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">long</span>[maxSize];
      nItems = 0;
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">insert</span>(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">item</span>)    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert item</span>
      {
      <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">j</span>;

      <span style="color: #fa8072;">if</span>(nItems==0)                         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if no items,</span>
         queArray[nItems++] = item;         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert at 0</span>
      <span style="color: #fa8072;">else</span>                                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if items,</span>
         {
         <span style="color: #fa8072;">for</span>(j=nItems-1; j&gt;=0; j--)         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">start at end,</span>
            {
            <span style="color: #fa8072;">if</span>( item &gt; queArray[j] )      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if new item larger,</span>
               queArray[j+1] = queArray[j]; <span style="color: #add8e6;">// </span><span style="color: #add8e6;">shift upward</span>
            <span style="color: #fa8072;">else</span>                          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if smaller,</span>
               <span style="color: #fa8072;">break</span>;                     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">done shifting</span>
            }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end for</span>
         queArray[j+1] = item;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert it</span>
         nItems++;
         }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end else (nItems &gt; 0)</span>
      }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end insert()</span>
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">remove</span>()             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">remove minimum item</span>
      { <span style="color: #fa8072;">return</span> queArray[--nItems]; }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">peekMin</span>()            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">peek at minimum item</span>
      { <span style="color: #fa8072;">return</span> queArray[nItems-1]; }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">boolean</span> <span style="color: #7fffd4; font-weight: bold;">isEmpty</span>()         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">true if queue is empty</span>
      { <span style="color: #fa8072;">return</span> (nItems==0); }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">boolean</span> <span style="color: #7fffd4; font-weight: bold;">isFull</span>()          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">true if queue is full</span>
      { <span style="color: #fa8072;">return</span> (nItems == maxSize); }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   } 
</pre>



</div>
</div>

</div>
