数据结构/栈和队列.org
** 例子
#+BEGIN_SRC java
  // infix.java
// converts infix arithmetic expressions to postfix
// to run this program: C>java InfixApp
import java.io.*;            // for I/O
////////////////////////////////////////////////////////////////
# 存储关系式的栈
class StackX
   {
   private int maxSize;
   private char[] stackArray;
   private int top;
//--------------------------------------------------------------
   public StackX(int s)       // constructor
      {
      maxSize = s;
      stackArray = new char[maxSize];
      top = -1;
      }
//--------------------------------------------------------------
   public void push(char j)  // put item on top of stack
      { stackArray[++top] = j; }
//--------------------------------------------------------------
   public char pop()         // take item from top of stack
      { return stackArray[top--]; }
//--------------------------------------------------------------
   public char peek()        // peek at top of stack
      { return stackArray[top]; }
//--------------------------------------------------------------
   public boolean isEmpty()  // true if stack is empty
      { return (top == -1); }
//-------------------------------------------------------------
   public int size()         // return size
      { return top+1; }
//--------------------------------------------------------------
   public char peekN(int n)  // return item at index n
      { return stackArray[n]; }
//--------------------------------------------------------------
#  显示栈中表达式的值
   public void displayStack(String s)
      {
      System.out.print(s);
      System.out.print("Stack (bottom-->top): ");
      for(int j=0; j<size(); j++)
         {
         System.out.print( peekN(j) );
         System.out.print(' ');
         }
      System.out.println("");
      }
//--------------------------------------------------------------
   }  // end class StackX
////////////////////////////////////////////////////////////////
# 实现转换表达式的类
class InToPost                  // infix to postfix conversion
   {
   private StackX theStack;
   private String input;
   private String output = "";
//--------------------------------------------------------------
   public InToPost(String in)   // constructor
      {
      input = in;
      int stackSize = input.length();
      theStack = new StackX(stackSize);
      }
//--------------------------------------------------------------
# 实现转换表达式的方法
   public String doTrans()      // do translation to postfix
      {
# 遍历要转换的字符串
      for(int j=0; j<input.length(); j++)      // for each char
         {
 #  取出每个字符
         char ch = input.charAt(j);            // get it
# 打印栈中当前表达式的值
         theStack.displayStack("For "+ch+" "); // *diagnostic*
# 针对当前字符的不同分别进行各种处理
         switch(ch)
            {
#  如果字符串为+ -,则执行goOper方法
            case '+':               // it's + or -
            case '-':
               gotOper(ch, 1);      // go pop operators
               break;               //   (precedence 1)
            case '*':               // it's * or /
            case '/':
               gotOper(ch, 2);      // go pop operators
               break;               //   (precedence 2)
            case '(':               // it's a left paren
               theStack.push(ch);   // push it
               break;
            case ')':               // it's a right paren
               gotParen(ch);        // go pop operators
               break;
            default:                // must be an operand
               output = output + ch; // write it to output
               break;
            }  // end switch
         }  // end for
      while( !theStack.isEmpty() )     // pop remaining opers
         {
         theStack.displayStack("While ");  // *diagnostic*
         output = output + theStack.pop(); // write to output
         }
      theStack.displayStack("End   ");     // *diagnostic*
      return output;                   // return postfix
      }  // end doTrans()
//--------------------------------------------------------------
#  取得操作符的方法,参数: +--->1;*/--->2
   public  void gotOper(char opThis, int prec1)
      {                                // got operator from input
# 如果栈不为空,执行如下操作
      while( !theStack.isEmpty() )
         {
# 取出栈顶元素
         char opTop = theStack.pop();
# 如果栈顶元素为(,则将栈顶元素入栈
         if( opTop == '(' )            // if it's a '('
            {
            theStack.push(opTop);      // restore '('
            break;
            }
# 如果栈顶元素不为(,则执行如下
         else                          // it's an operator
            {
            int prec2;                 // precedence of new op
# 如果栈顶元素为+ -,设置prec2值为1,否则设置为2
            if(opTop=='+' || opTop=='-')  // find new op prec
               prec2 = 1;
            else
               prec2 = 2;
# 如果传入的字符的优先级大于栈顶元素的优先级,则入栈
            if(prec2 < prec1)          // if prec of new op less
               {                       //    than prec of old
               theStack.push(opTop);   // save newly-popped op
               break;
               }
# 如果传入的字符的优先级小于栈顶元素的优先级,则将该字符和栈顶元素拼接
            else                       // prec of new not less
               output = output + opTop;  // than prec of old
            }  // end else (it's an operator)
         }  // end while
# 如果栈为空,则将该字符入栈
      theStack.push(opThis);           // push new operator
      }  // end gotOp()
//--------------------------------------------------------------
# 取得匹配的操作符
   public  void gotParen(char ch)
      {                             // got right paren from input
# 如果栈为空
      while( !theStack.isEmpty() )
         {
# 取栈顶元素
         char chx = theStack.pop();
# 如果栈顶元素为(,退出循环,否则将该字符与输出的字符拼接
         if( chx == '(' )           // if popped '('
            break;                  // we're done
         else                       // if popped operator
            output = output + chx;  // output it
         }  // end while
      }  // end popOps()
//--------------------------------------------------------------
   }  // end class InToPost
////////////////////////////////////////////////////////////////
class InfixApp
   {
   public static void main(String[] args) throws IOException
      {
      String input, output;
      while(true)
         {
         System.out.print("Enter infix: ");
         System.out.flush();
         input = getString();         // read a string from kbd
         if( input.equals("") )       // quit if [Enter]
            break;
                                      // make a translator
         InToPost theTrans = new InToPost(input);
         output = theTrans.doTrans(); // do the translation
         System.out.println("Postfix is " + output + '\n');
         }  // end while
      }  // end main()
//--------------------------------------------------------------
   public static String getString() throws IOException
      {
      InputStreamReader isr = new InputStreamReader(System.in);
      BufferedReader br = new BufferedReader(isr);
      String s = br.readLine();
      return s;
      }
//--------------------------------------------------------------
   }  // end class InfixApp
////////////////////////////////////////////////////////////////

#+END_SRC
